{
  "data": {
    "category_list": [
      "political-pulse",
      "sports",
      "business",
      "technology",
      "education"
    ],
    "news_list": [
      {
        "id": "f257a241adca4ecd8c3fb04cf033eb81",
        "title": "West Bengal Police cracks down on anti-India social media posts; accused arrested from many places",
        "description": "India-Pakistan ceasefire has been raging on the west side of India, police have said in a statement to the Hindus' daily news service The Hindus have arrested six to eight people over the past few days for making posts on social media that indicated anti-India sentiments or any mischief and were made from Balagarh, Asansol, Howrah, Barasat, Bankura and Uttar Dinajpur.",
        "urlToImage": "https://th-i.thgim.com/public/incoming/rg3d54/article69493446.ece/alternates/LANDSCAPE_1200/PTI04_13_2025_000016B.jpg",
        "url": "https://www.thehindu.com/news/national/west-bengal/west-bengal-police-cracks-down-on-anti-india-social-media-posts-accused-arrested-from-many-places/article69568466.ece",
        "category": "india",
        "date": "12 May 2025 - 5 hrs ago"
      },
      {
        "id": "1d462fba00194bd38034fed078fae388",
        "title": "₹10 crore allotted for Aluva Market Road widening",
        "description": "A road-widening project has been approved by the Ministry of Public Works (MoU) to widen a 350-metre-long stretch of Aluva Market Road, it has been announced in a press conference on Thursday. It is expected to cost 6.75 crore for the project, which will be completed by 2021. The project would also improve the commercial prospects of the market, the minister said.",
        "urlToImage": "https://placehold.co/600x450/333333/FFFFFF?text=Image+Not+Available",
        "url": "https://www.thehindu.com/news/national/kerala/10-crore-allotted-for-aluva-market-road-widening/article69568478.ece",
        "category": "india",
        "date": "12 May 2025 - 5 hrs ago"
      },
      {
        "id": "6d1ca045155b463a94decabdf3d177db",
        "title": "U.S.-China trade agreement a mixed bag for India, say trade experts",
        "description": "US and China have agreed to reduce tariffs on Chinese goods to 30% from the 145% it raised them to, according to a joint statement issued by the International Monetary Fund (IMF) in Geneva. The two countries also said they will continue talks to further work out their trade issues with each other over the next few months. It is not clear how the deal would affect India’s exports, but experts say it could help boost exports in sectors that remain relatively",
        "urlToImage": "https://th-i.thgim.com/public/incoming/2umdoo/article69532083.ece/alternates/LANDSCAPE_1200/2025-04-29T100021Z_232035278_RC2MTDA3UT0W_RTRMADP_3_USA-TRUMP-TARIFFS-BUSINESS.JPG",
        "url": "https://www.thehindu.com/business/Economy/us-china-trade-agreement-a-mixed-bag-for-india-trade-experts-say/article69567650.ece",
        "category": "business",
        "date": "12 May 2025 - 5 hrs ago"
      },
      {
        "id": "e3e589191b8b41e9a8c9055021e1d63d",
        "title": "Bound by a thread: Tendulkar recalls Kohli's special gesture on retirement day",
        "description": "Sachin Tendulkar has died at the age of 84, after his father's death in Mumbai on May 12 and his son Virat Kohli's last Test against India in 2025 was abandoned by Indian cricket legend Virat Kotanayev to become one of the world's most famous cricketers for 21 years before becoming the first man to be named as the \"Master Blaster\" in the country.",
        "urlToImage": "https://th-i.thgim.com/public/incoming/hfgfdc/article69568953.ece/alternates/LANDSCAPE_1200/25_Index_Sachin_25_03_Del.jpg",
        "url": "https://www.thehindu.com/sport/cricket/bound-by-a-thread-tendulkar-recalls-kohlis-special-gesture-on-retirement-day/article69568919.ece",
        "category": "sports",
        "date": "12 May 2025 - 5 hrs ago"
      },
      {
        "id": "b4f97866a02045b48b0406e33e526100",
        "title": "NTR Collector sanctions tricycle to physically challenged person in one hour",
        "description": "Mr. Lakshmisha, who was about to proceed to Tiruvuru, observed Thambi crawling on the Collectorate premises. “As both my legs are paralysed, I was unable to do any work. Please sanction a tricycle for me,” Mr. Thambi told the Collector and showed his Aadhaar Card and Physically Handicapped certificate issued by the government.",
        "urlToImage": "https://th-i.thgim.com/public/incoming/4x9hnh/article69568922.ece/alternates/LANDSCAPE_1200/WhatsApp%20Image%202025-05-12%20at%2021.37.14.jpeg",
        "url": "https://www.thehindu.com/news/national/andhra-pradesh/ntr-collector-sanctions-tricycle-to-physically-challenged-person-in-one-hour/article69568715.ece",
        "category": "india",
        "date": "12 May 2025 - 5 hrs ago"
      },
      {
        "id": "f57ca8a5d7dd429586252fe4169537b7",
        "title": "Need collective efforts to develop Tiruvuru Assembly constituency: Vijayawada MP",
        "description": "Vijayawada MP Kesineni Sivanath stressed the need for collective efforts to develop Tiruvuru Assembly constituency, and pledged his support to achieve the developmental goals of PGRS programme. He said people need not travel to the NTR district headquarters to have their issues resolved as they could approach the officials locally under the PGSC. Mr. Sivanama said that a total of 278 petitions were received during",
        "urlToImage": "https://th-i.thgim.com/public/incoming/vh0x7u/article69568277.ece/alternates/LANDSCAPE_1200/10215_12_5_2025_19_56_39_2_WHATSAPPIMAGE2025_05_12AT64259PM.JPG",
        "url": "https://www.thehindu.com/news/national/andhra-pradesh/need-collective-efforts-to-develop-tiruvuru-assembly-constituency-vijayawada-mp/article69568284.ece",
        "category": "india",
        "date": "12 May 2025 - 6 hrs ago"
      },
      {
        "id": "5fc60d3e3b9b406cbf211eae709e4051",
        "title": "Committee to be formed for amendments to Cooperative Societies Act in Maharashtra, says CM Fadnavis",
        "description": "Maharashtra Chief Minister Devendra Fadnavis on Monday (May 12, 2025) announced the formation of a committee to look into amendments to the Maharashttra Cooperative Societies Act, 1960. The Union Minister of Road Transport Nitin Gadkari recommends the formulation of new law for the cooperative sector in the State to factor evolving economic conditions and market competition. Mr. Gadcari also suggested a detailed study to examine the socio",
        "urlToImage": "https://th-i.thgim.com/public/incoming/uzeh9v/article69568884.ece/alternates/LANDSCAPE_1200/Gqw6ByPWIAAoGXs.jpg",
        "url": "https://www.thehindu.com/news/national/maharashtra/committee-to-be-formed-for-amendments-to-cooperative-societies-act-in-maharashtra-says-fadnavis/article69568182.ece",
        "category": "india",
        "date": "12 May 2025 - 6 hrs ago"
      },
      {
        "id": "0ba1b9e147c94ff3be8ac58222c7bf56",
        "title": "False promise of marriage’ untenable after live-in relationship for years: SC",
        "description": "A court in Uttarakhand has refused to quash the case of a man accused of having forcible sex with a woman he had entered into a settlement deed affirming their mutual love and intention to marry each other, the Supreme Court has said. It is not clear whether it was an allegation that such a relationship was entered into because there was a promise of marriage in the circumstances unworthy of acceptance.",
        "urlToImage": "https://th-i.thgim.com/public/incoming/cqkb6q/article69568944.ece/alternates/LANDSCAPE_1200/PTI04_16_2025_000222B.jpg",
        "url": "https://www.thehindu.com/news/national/false-promise-of-marriage-untenable-after-live-in-relationship-for-years-sc/article69568705.ece",
        "category": "india",
        "date": "12 May 2025 - 6 hrs ago"
      },
      {
        "id": "13b33d297f294a9b95b600d937ee1c65",
        "title": "KEA launches three student-friendly digital platforms",
        "description": "The Karnataka Examinations Authority (KEA) launched three digital initiatives on Monday. These include a portal that gives all relevant information about colleges in the State, a mobile app that provides all services, and an Artificial Intelligence (AI) powered chatbot. It was launched a few days ago and since then, over 1.35 lakh students have used it to seek information. They have been using it for years.",
        "urlToImage": "https://th-i.thgim.com/public/incoming/9bznlo/article69568868.ece/alternates/LANDSCAPE_1200/_KMK9672.JPG",
        "url": "https://www.thehindu.com/news/cities/bangalore/kea-launches-three-student-friendly-digital-platforms/article69567247.ece",
        "category": "india",
        "date": "12 May 2025 - 6 hrs ago"
      },
      {
        "id": "732589a4a3e049c1866d4efcdda5ebeb",
        "title": "IPL to resume on May 17, final on June 3",
        "description": "The Indian Premier League (IPL) will play the remaining 17 matches from May 17 to June 3 in Jaipur on May 24, 2025, according to a revised schedule for the remainder of the TATA IPL 2025. A total of 17 matches will be played across 6 venues, starting May 17, and culminating in the final on June 3, with Chennai and Hyderabad missing from the list. It is not clear how long it will take for the remaining 13 league games to be played",
        "urlToImage": "https://th-i.thgim.com/public/incoming/nlr7bn/article69557548.ece/alternates/LANDSCAPE_1200/IMG_LATEST_IPL_TROPHY_2_1_V5E57QHF.jpg",
        "url": "https://www.thehindu.com/sport/cricket/ipl-to-resume-on-may-17-final-on-june-3/article69568842.ece",
        "category": "sports",
        "date": "12 May 2025 - 6 hrs ago"
      },
      {
        "id": "0f5393fc77d14ddf95f9f1619efa7ebf",
        "title": "Modi’s address silent on Trump’s claim of U.S. averting nuclear conflict by threatening to stop trade: Congress",
        "description": "Prime Minister Narendra Modi’s address to the nation was completely upstaged by President Trump’s revelations a few minutes earlier. The PM was completely silent on them. Has India agreed to U.S. mediation? Has India agree to a ‘neutral site’ for a dialogue with Pakistan? Will India now give in on US demands for opening Indian markets in autos, agriculture, and other areas?” Mr. Ramesh asked in a post",
        "urlToImage": "https://th-i.thgim.com/public/incoming/7ixhx9/article69568840.ece/alternates/LANDSCAPE_1200/20250501065L.jpg",
        "url": "https://www.thehindu.com/news/national/modis-address-silent-on-trumps-claim-of-us-averting-nuclear-conflict-by-threatening-to-stop-trade-congress/article69568688.ece",
        "category": "india",
        "date": "12 May 2025 - 6 hrs ago"
      },
      {
        "id": "e5e029c67cb34c0dae9ccc1820a56ba9",
        "title": "Untouchability is being practised in the country in myriad ways, says Madras High Court",
        "description": "Justice D. Bharatha Chakravarthy denounced caste as a form of untouchability in the country, saying it is “not accepting the donation from a person perceived to be an inferior human being is another form,” the judge said. The Hindu Religious and Charitable Endowments (HR&CE) Department has decided to dispose of a representation made by the writ petitioner for accepting donations from all willing donors.",
        "urlToImage": "https://placehold.co/600x450/333333/FFFFFF?text=Image+Not+Available",
        "url": "https://www.thehindu.com/news/national/tamil-nadu/untouchability-is-being-practised-in-the-country-in-myriad-ways-says-madras-high-court/article69568120.ece",
        "category": "india",
        "date": "12 May 2025 - 6 hrs ago"
      },
      {
        "id": "b56adbd4476f465caa3986bc42142205",
        "title": "86,000 ‘excess deaths’ in West Bengal in 2021; four times official Covid casualties",
        "description": "South 24 Parganas (+11,250), and Hooghly (+13,250) have recorded the highest annual spike in deaths in West Bengal from 2020 to 2021, according to a report released by the Central Government of India. The country's population is estimated to be at around 86,736 under the age of 18, more than double the official COVID-19 death toll for the state in 2021.",
        "urlToImage": "https://th-i.thgim.com/public/incoming/dxxoat/article69568829.ece/alternates/LANDSCAPE_1200/IMG_COVID-19_Testing_2_1_CIB4NG3O.jpg",
        "url": "https://www.thehindu.com/news/national/west-bengal/86000-excess-deaths-in-west-bengal-in-2021-four-times-official-covid-casualties/article69568320.ece",
        "category": "india",
        "date": "12 May 2025 - 6 hrs ago"
      },
      {
        "id": "35ac2a29bb014461a4b4a07aeb044ca7",
        "title": "BJP’s politics is hybrid and Congress politics is national: Jagga Reddy",
        "description": "TPCC working president T. Jagga Reddy invoked the leadership of former Prime Minister Indira Gandhi, praising her decisive role during the 1971 India-Pakistan war and said the BJP is still trying to undermine her contribution in winning wars. Speaking to reporters at Gandhi Bhavan on Monday, Mr. Reddy said that even during the present Indo-Pak conflict Indian’s courage was being discussed to teach Pakistan a lesson. He",
        "urlToImage": "https://th-i.thgim.com/public/news/national/telangana/eodsm4/article69568672.ece/alternates/LANDSCAPE_1200/Jagga.jpeg",
        "url": "https://www.thehindu.com/news/national/telangana/bjps-politics-is-hybrid-and-congress-politics-is-national-jagga-reddy/article69568668.ece",
        "category": "india",
        "date": "12 May 2025 - 6 hrs ago"
      },
      {
        "id": "cd9feacf94a54515b642bd963c05c446",
        "title": "Chief Minister meets Governor to appraise him of situation in Telangana",
        "description": "A Revanth Reddy met Governor Jishnu Dev Varma on Monday morning and discussed with him various issues concerning the State in the backdrop of the Indo-Pak conflict and how the State was on alert to deal with any situation. The Chief Minister is said to have requested the Governor to clear the file related to the appointment of the Information Commissioners that was pending at Raj Bhavan for the last few days. Interestingly, a few hours after the",
        "urlToImage": "https://th-i.thgim.com/public/news/national/telangana/4hgnmc/article69568779.ece/alternates/LANDSCAPE_1200/CM%20meets%20Governor%20.jpeg",
        "url": "https://www.thehindu.com/news/national/telangana/chief-minister-meets-governor-to-appraise-him-of-situation-in-telangana/article69568785.ece",
        "category": "india",
        "date": "12 May 2025 - 6 hrs ago"
      },
      {
        "id": "f4d0240fa7cb44499ed8af83172de9c8",
        "title": "Australia, Bangladesh, Nepal welcome ‘understanding’ to pause firing and military action between India and Pakistan",
        "description": "Australia has welcomed the “understanding” between India and Pakistan to stop firing and military action on the Line of Control and the International Border (IB) that was reached on May 10 amidst tense circumstances, Foreign Minister Penny Wong held a telephone call with External Affairs Minister S. Jaishankar and Pakistan’s Foreign Minister Ishaq Dar, describing the process of de-escalation as ‘critical to regional peace and security’",
        "urlToImage": "https://th-i.thgim.com/public/incoming/li6hne/article69568784.ece/alternates/LANDSCAPE_1200/IMG_Australian_Foreign_M_2_1_A1CLA0PD.jpg",
        "url": "https://www.thehindu.com/news/national/australia-bangladesh-nepal-welcome-understanding-to-pause-firing-and-military-action-between-india-and-pakistan/article69568616.ece",
        "category": "india",
        "date": "12 May 2025 - 6 hrs ago"
      },
      {
        "id": "19c1170252ba4440b77882315d4e37e8",
        "title": "India, Pakistan to cut troops on borders",
        "description": "India-Pakistan ceasefire” was agreed during talks between the Directors-General of Military Operations (DGMOs) of the two countries that were held on the established hotline at 5 p.m. “Issues related to continuing the commitment that both sides must not fire a single shot or initiate any aggressive and inimical action against each other were discussed,” the Army said. While that was violated by Pakistan within few hours, guns fell silent",
        "urlToImage": "https://th-i.thgim.com/public/incoming/w7qotp/article69568948.ece/alternates/LANDSCAPE_1200/THREE%20SERVICE%20PC%20INDIA%20PAKISTAN%20%20DELHI%202025_12_05_28.jpg",
        "url": "https://www.thehindu.com/news/national/india-pakistan-agree-not-to-fire-a-single-shot/article69568591.ece",
        "category": "india",
        "date": "12 May 2025 - 7 hrs ago"
      },
      {
        "id": "8a74af0c472d4e399c0606b54668833b",
        "title": "Chouhan reviews kharif sowing; increase in paddy, pulses acreage",
        "description": "Sowing of paddy, pulses, coarse grains and oilseeds has expanded this kharif season, said the Agriculture Ministry in New Delhi on Monday (May 12, 2025), after a meeting chaired by Union Minister Shivraj Singh Chouhan. As on May 2, sowing of panda had increased by 3.44 lakh hectares while the sowing area of potato has also increased by 0.47 lakh tonnes.",
        "urlToImage": "https://th-i.thgim.com/public/incoming/lxl2om/article69568773.ece/alternates/LANDSCAPE_1200/20250504086L.jpg",
        "url": "https://www.thehindu.com/news/national/chouhan-reviews-kharif-sowing-increase-in-paddy-pulses-acreage/article69568265.ece",
        "category": "india",
        "date": "12 May 2025 - 7 hrs ago"
      },
      {
        "id": "284d1e4d53b94f9482ed29d7d2a8b36d",
        "title": "Shah Rukh Khan enjoyed watching Bhool Bhulaiyaa 2, says Kartik Aaryan: ‘He always discusses my films…’",
        "description": "Bhool Bhulaiyaa 2 is among the highest-grossing films of 2022, according to Kartik Aaryan and Kangana Ranaut in a recent interview with Filmfare. The film received acclaim from all quarters, with several actors—including Kanganara Ranaut—praising Kartik for drawing audiences back to theatres. It was also among the most-grosesing films by 2022.",
        "urlToImage": "https://images.indianexpress.com/2025/05/shahrukh-khan.jpg",
        "url": "https://indianexpress.com/article/entertainment/bollywood/shah-rukh-khan-enjoyed-watching-bhool-bhulaiyaa-2-says-kartik-aaryan-9998568/",
        "category": "entertainment",
        "date": "12 May 2025 - 7 hrs ago"
      },
      {
        "id": "88938f8a8b1a4123aa5d8058f79e4b16",
        "title": "When Virat said, ‘I get a good feel coming to Visakhapatnam, it is similar to Adelaide",
        "description": "Visakhapatnam celebrate the first ever Test match between India and England at Dr. YSR ACA-VDCA Stadium, unveiling a commemorative pylon and presenting mementoes to both Indian and English players. It was a historic day for the Andhra Cricket Association (ACA) and the cricket fans of Andhran Pradesh. The red ball cricket had arrived in the region for the first time, drawing thousands from across the state",
        "urlToImage": "https://th-i.thgim.com/public/incoming/uko4xo/article66639229.ece/alternates/LANDSCAPE_1200/20230319093L.jpg",
        "url": "https://www.thehindu.com/sport/cricket/when-virat-said-i-get-a-good-feel-coming-to-visakhapatnam-it-is-similar-to-adelaide/article69567069.ece",
        "category": "sports",
        "date": "12 May 2025 - 7 hrs ago"
      },
      {
        "id": "fd66a1407e3a493ba2d671dad3f7ac50",
        "title": "Tata Steel Q4 net profit more than doubles to ₹1,301 crore",
        "description": "Tata Steel Ltd. has posted a net profit of 1,301 crore in the year-earlier period. Revenue from operations during the period declined 5% YoY to 55,707 crore. The Board of Directors recommended a dividend for 3.60 per ordinary (equity) share of face value of $1 each. Tata Tiscon achieved best-ever volumes and grew by 19% YoY at around 2.4 million tonnes.",
        "urlToImage": "https://th-i.thgim.com/public/incoming/dn595c/article69568577.ece/alternates/LANDSCAPE_1200/IMG_ciisouth_16.jpg_2_1_24DI998V.jpg",
        "url": "https://www.thehindu.com/business/tata-steel-q4-net-profit-more-than-doubles-to-1301-crore/article69568444.ece",
        "category": "business",
        "date": "12 May 2025 - 7 hrs ago"
      },
      {
        "id": "313779ddcf74472b9fc692f22b55578c",
        "title": "‘Kalpana never got the recognition she deserved from cinema,’ says sister Urvashi: ‘She would have received many good roles today’",
        "description": "Urvashi’s ad, “Kalpana should have been alive today,” she said in an exclusive conversation with SCREEN. ‘She influenced me in every way. As actors, all our mannerisms came from our mother. Even when talking at home or on the phone, one couldn’t tell if it’s mom, me or Kalpana. In Tamil Nadu, it's easy for the people to recognise because mom and",
        "urlToImage": "https://images.indianexpress.com/2025/05/Urvashi-Kalpana-12052025.jpg",
        "url": "https://indianexpress.com/article/entertainment/malayalam/kalpana-never-got-the-recognition-she-deserved-from-cinema-says-urvashi-9998521/",
        "category": "entertainment",
        "date": "12 May 2025 - 8 hrs ago"
      },
      {
        "id": "c314d9743f2845a38361278f84416eb2",
        "title": "BCRC seeks remuneration review of Bank Mitras",
        "description": "Banks & Bank Mitras have appealed to Parliamentary Committee on Finance to review the remuneration of bankers and seek subsidy on their infrastructure costs, an industry body has told BBC Radio 4's Business Correspondent Resource Council (BCRC) has said in a letter to Prime Minister Bhartruhari Mahtab that it is not necessary to revise the rate for ATM interoperability charges.",
        "urlToImage": "https://th-i.thgim.com/public/incoming/6sjxyd/article69568537.ece/alternates/LANDSCAPE_1200/9712_24-7-2020_15-33-56_1_DSC_6862.JPG",
        "url": "https://www.thehindu.com/business/bcrc-seeks-remuneration-review-of-bank-mitras/article69567219.ece",
        "category": "business",
        "date": "12 May 2025 - 8 hrs ago"
      },
      {
        "id": "317f01a4a9e64520ac40970772908782",
        "title": "F1 trailer: Brad Pitt plays ‘oldtimer’ who needs to deal with both his past and a rookie to save his friend’s struggling APXGP team",
        "description": "Brad Pitt and Lewis Hamilton are set to play the role of Sonny Hayes, a former Formula 1 driver who returns to the sport after a devastating crash decades earlier. The film is set to release worldwide on June 25. It stars Brad Pitt in the lead role, which is directed by Top Gun: Maverick director Joseph Kosinski. A trailer for F1's first season will be released on June 26.",
        "urlToImage": "https://images.indianexpress.com/2025/05/Brad-Pitt.jpg",
        "url": "https://indianexpress.com/article/entertainment/hollywood/f1-trailer-brad-pitt-plays-the-oldtimer-who-needs-to-deal-with-both-his-past-and-a-rookie-9998424/",
        "category": "entertainment",
        "date": "12 May 2025 - 8 hrs ago"
      },
      {
        "id": "b8abcd0fef294ac1bf1604b9d0601776",
        "title": "Gradiente Infotainment to invest ₹5,000 crore in scalable media ventures",
        "description": "Gradiente Infotainment Ltd. will invest 5,000 crore in the next three years across India and the MENA region to boost media and culture initiatives, the company said in a statement. The company told The Hindu that it would explore a public float in March 2026 to raise 1,000 crore. It would also raise funds from High Net Worth Individuals and avail debt from financial institutions. “We are a listed company on Calcutta",
        "urlToImage": "https://placehold.co/600x450/333333/FFFFFF?text=Image+Not+Available",
        "url": "https://www.thehindu.com/business/gradiente-infotainment-to-invest-5000-crore-in-scalable-media-ventures/article69567836.ece",
        "category": "business",
        "date": "12 May 2025 - 9 hrs ago"
      },
      {
        "id": "043d6a751f3448bdbaf857975eb67ef1",
        "title": "Is US-China trade deal good news for India or bad? Experts say…",
        "description": "The US and China have reached a deal to reduce the tariffs on Chinese goods for 90 days, according to India’s Federation of Indian Export Organisations (FIEO) President SC Ralhan said in a news conference at the country’s headquarters in Beijing. “We must actively engage with the US to secure and expand its preferential trade access, emphasising its role as a reliable alternative sourcing destination,” he said.",
        "urlToImage": "https://images.firstpost.com/uploads/2025/05/Representational-Image-2025-05-12T200639.070-2025-05-54d91008437e5ff3558d2e6e30c90046.jpg",
        "url": "https://www.firstpost.com/world/is-us-china-trade-deal-good-news-for-india-or-bad-experts-say-13887831.html",
        "category": "world",
        "date": "12 May 2025 - 9 hrs ago"
      },
      {
        "id": "1045b42ea8b9449a9723b0edc6cc942e",
        "title": "Sunita Ahuja says she feels bad seeing husband Govinda sitting at home: ‘Anil Kapoor, Suniel Shetty, Jackie Shroff are doing so much work…’",
        "description": "Sunita Ahuja, a major star in the 1990s, has declined opportunities in the OTT space and is worried about his family’s wish to see Govinda return to the big screen. But she said: “I keep asking him to have better company. Why is a legend like you sitting at home? Actors of your age are doing so much work, including Anil Kapoor, Suniel Shetty, and Jackie Sh",
        "urlToImage": "https://images.indianexpress.com/2025/05/Govinda-Sunita-Ahuja.jpg",
        "url": "https://indianexpress.com/article/entertainment/bollywood/sunita-ahuja-says-she-feels-bad-seeing-husband-govinda-sitting-at-home-9996347/",
        "category": "entertainment",
        "date": "12 May 2025 - 9 hrs ago"
      },
      {
        "id": "6e5ea578e67341b288cb446e3d50353d",
        "title": "'We stopped a nuclear conflict': Trump again claims credit for India-Pakistan 'ceasefire'",
        "description": "President Donald Trump on Monday again claimed the credit for India-Pakistan ‘ceasefire’, saying that US intervention prevented a “bad nuclear war” between the rivals. “We stopped a nuclear conflict. I think it could have been a bad nuclear war, millions of people could have be killed. So I’m very proud of that,” AFP quoted Trump as telling reporters at the White House. Trump said his administration helped broker what may be a permanent",
        "urlToImage": "https://images.firstpost.com/uploads/2025/05/Representational-Image-2025-05-04T200819.830-2025-05-491d53810cb8265c7583ef357d8377df.jpg",
        "url": "https://www.firstpost.com/world/we-stopped-a-nuclear-conflict-trump-again-claims-credit-for-india-pakistan-ceasefire-13887826.html",
        "category": "world",
        "date": "12 May 2025 - 9 hrs ago"
      },
      {
        "id": "fdb879ac24c940f0b5c3a6d966adb835",
        "title": "Myanmar airstrike on school kills at least 22; dozens injured in bombing",
        "description": "A military airstrike carried out by Myanmarâs junta on Monday struck a school in the central Sagaing region, leaving at least 20 students and two teachers dead, according to a resistance group member, an aid worker, and media accounts. The strike occurred in the morning in Ohe Htein Twin village, located in Tabayin township, also known as Depayin in Singapore, May12, 2025.",
        "urlToImage": "https://images.firstpost.com/uploads/2025/05/Representational-Image-2025-05-12T195026.884-2025-05-2e1ee8e46a4391f23c9a344e6eca56d6.jpg",
        "url": "https://www.firstpost.com/world/myanmar-airstrike-on-school-kills-at-least-22-dozens-injured-in-bombing-13887824.html",
        "category": "world",
        "date": "12 May 2025 - 9 hrs ago"
      },
      {
        "id": "d8be48cc04244b3485ff26bbebc89e55",
        "title": "Zeenat Aman says Rishi Kapoor kept his distance, was bothered by her height: ‘Nasir Saab propped him up on two cushions…’",
        "description": "Zeenat Aman has appeared in more than 80 films since the 1970s, starring Dharmendra, Dev Anand, Amitabh Bachchan, Rishi Kapoor, and Nasir Hussain’s Hum Kisise Kum Naheen. The actress also shared a rare song and a flirtatious scene she filmed with Rishi, revealing that he was quite irritated by their height difference",
        "urlToImage": "https://images.indianexpress.com/2025/05/Zeenat-Aman-4.jpg",
        "url": "https://indianexpress.com/article/entertainment/bollywood/zeenat-aman-says-rishi-kapoor-kept-his-distance-was-bothered-by-her-height-9998339/",
        "category": "entertainment",
        "date": "12 May 2025 - 9 hrs ago"
      },
      {
        "id": "680c35cc596c4d5d8432267a69f7044e",
        "title": "Kohli had made up his mind to quit longer format: sources",
        "description": "Virat Kohli’s decision to retire from Test cricket may have been a surprise for Indian cricket fans, according to an official source in the country's National Cricket League (NRL) news agency. The former India batsman is believed to have made up his mind to let the younger lot take over ahead of the new World Test Championship cycle at the end of last month. But it was not clear whether he would be willing to reconsider his decision.",
        "urlToImage": "https://th-i.thgim.com/public/incoming/mweuga/article69568012.ece/alternates/LANDSCAPE_1200/Australia_India_Cricket_59332.jpg",
        "url": "https://www.thehindu.com/sport/cricket/kohli-had-made-up-his-mind-to-quit-longer-format-sources/article69567858.ece",
        "category": "sports",
        "date": "12 May 2025 - 9 hrs ago"
      },
      {
        "id": "42b517bfe68f4ed8b216ad38e218222c",
        "title": "After Zelenskyy's 'Putin should attend in Person' remark, Kremlin says serious about talks but offers no details",
        "description": "The Kremlin said on Monday that President Vladimir Putin is genuinely committed to pursuing peace through direct talks with Ukraine but declined to provide further details after Ukraine insisted that the Russian leader attend the talks in person. On Sunday, Putin proposed direct talks in Turkey aimed at ending the conflict. US President Donald Trump publicly told Ukrainian President Volodymyr Zelenskyy to accept, but Zelnskyy said he would but that Putin should attend in person",
        "urlToImage": "https://images.firstpost.com/uploads/2025/03/RUSSIA-PUTIN1200-1-2025-03-dbaf67f75402be4f698c8cb5ac7bafd8.jpg",
        "url": "https://www.firstpost.com/world/after-zelenskyys-putin-should-attend-in-person-remark-kremlin-says-serious-about-talks-but-offers-no-details-13887816.html",
        "category": "world",
        "date": "12 May 2025 - 9 hrs ago"
      },
      {
        "id": "8758168081cc4a27a2c9b0bb54502505",
        "title": "Kohli changed the culture of Indian cricket, says childhood coach Rajkumar",
        "description": "Virat Kohli, 59, was at his best as a Test batter when he retired from the Tests in 2014-15, according to India's cricket coach Rajkumar Sharma. But it wasn't all that easy for him to get out of the country and win matches for the country. \"I think he should still play till the 2027 ODI World Cup,\" he told The Hindu on Monday.",
        "urlToImage": "https://th-i.thgim.com/public/incoming/wyu59k/article69567628.ece/alternates/LANDSCAPE_1200/kohli-coach.jpg",
        "url": "https://www.thehindu.com/sport/cricket/kohli-changed-the-culture-of-indian-cricket-says-childhood-coach-rajkumar/article69567641.ece",
        "category": "sports",
        "date": "12 May 2025 - 10 hrs ago"
      },
      {
        "id": "a0257f92b22c4f1e8283ba19d2f91178",
        "title": "Amid beating from India, Baloch rebels also claim 71 attacks on Pakistani forces",
        "description": "Baloch Liberation Army (BLA) has said that it has conducted 71 coordinated attacks at 51 locations in its ongoing ‘Operation Herof’. Read more Militant tribemen carry their weapons during routine training in the autonomous region of Kohlu in the southeast of Balochistan province. The BLA is the primary armed group part of the self-determination movement of the Baloch people. India has devastated at least eight airbases of Pakistan in addition",
        "urlToImage": "https://images.firstpost.com/uploads/2025/03/bla-2025-03-601a861753bfad5d1bd59b1bb848f2fe.jpg",
        "url": "https://www.firstpost.com/world/amid-beating-from-india-baloch-rebels-also-claim-71-attacks-on-pakistani-forces-13887798.html",
        "category": "world",
        "date": "12 May 2025 - 11 hrs ago"
      },
      {
        "id": "f7aaf966ee2b4beb816f0a4e4b31ff4f",
        "title": "India extends $50 million financial support to debt-ridden Maldives",
        "description": "India says it has extended financial support to the Maldives by rolling over New Delhiâs subscription to a $50 million treasury bill by another year at the request of the archipelago's government. The State Bank of India has extended the subscription to the bill issued by the Maldivian finance ministry, India&rsquo;s high commission there said in a statement on its X account.",
        "urlToImage": "https://images.firstpost.com/uploads/2025/05/Representational-Image-2025-05-12T174409.218-2025-05-f27ac557ca7f75fb134af82071b2d648.jpg",
        "url": "https://www.firstpost.com/world/india-extends-50-million-financial-support-to-debt-ridden-maldives-13887770.html",
        "category": "world",
        "date": "12 May 2025 - 11 hrs ago"
      },
      {
        "id": "7f10fe8296dc407aac075f53f30af6f7",
        "title": "Stormy Sea, Xanthe, Kavya and Dreamer excel",
        "description": "In fine condition, Blue Picasso (Saqlian), Palma (Chetan K) 1-13, 600/43. Moved on the bit. Luna (Dhebe), Tropical Paradise (N.S. Parmar) 1-30, 1,000/1-15, 600/44.5. They moved on a bit. Morano (Tejeshwar) 1-29, 1000/1-14.5, 600/35.5.",
        "urlToImage": "https://placehold.co/600x450/333333/FFFFFF?text=Image+Not+Available",
        "url": "https://www.thehindu.com/sport/races/horse-racing/article69567389.ece",
        "category": "sports",
        "date": "12 May 2025 - 11 hrs ago"
      },
      {
        "id": "e5d3febc3c8d4a33b69795f0aba3a91b",
        "title": "Cricket Australia will back Australian players who don't want to return to India for IPL",
        "description": "Australia's players have been urged to return to the Indian Premier League after the suspension of the IPL, according to a report by the Sydney Morning Herald (Sydney Morning Herald) in London. The Australians are also concerned about the prospect of being frozen out of future editions of the International Cricket Council (IPL), which is set to resume next week. It is not clear how long it will take for them to return.",
        "urlToImage": "https://th-i.thgim.com/public/incoming/p3t86q/article69567155.ece/alternates/LANDSCAPE_1200/PTI05_09_2025_000401B.jpg",
        "url": "https://www.thehindu.com/sport/cricket/cricket-australia-will-back-australian-players-who-dont-want-to-return-to-india-for-ipl/article69567058.ece",
        "category": "sports",
        "date": "12 May 2025 - 12 hrs ago"
      },
      {
        "id": "af3073a937cf4d0eae2047649fd20a8f",
        "title": "Netanyahu delinks safe passage of American hostage from Gaza truce, says not agreed to ceasefire with Hamas",
        "description": "Hamas is set to release Israeli-American hostage Edan Alexander from Gaza on Monday, the Palestinian militant group said, although Israel’s prime minister said there would be no ceasefire and plans for an intensified military campaign would continue. Fighting will pause to allow for Alexander’s safe passage, Prime Minister Benjamin Netanyahu said, a day after Israel was told of Hammas’ decision to free the last surviving U.S. hostage in Gaza as a good",
        "urlToImage": "https://images.firstpost.com/uploads/2025/05/250116-adi-alexander..._imresizer-2025-05-a9d0ac927863e7e1b47f24e9b24a3132.jpg",
        "url": "https://www.firstpost.com/world/netanyahu-delinks-safe-passage-of-american-hostage-from-gaza-truce-says-not-agreed-to-ceasefire-with-hamas-13887729.html",
        "category": "world",
        "date": "12 May 2025 - 12 hrs ago"
      },
      {
        "id": "a38ac81912214278979ea627e2a8c365",
        "title": "Markets log biggest single-day gains as border tensions ease, U.S.-China lower tariffs",
        "description": "Sensex and Nifty’s biggest single-day gains in absolute terms on Monday (May 12, 2025), as border tensions eased and the U.S. and China agreed to lower tariffs on Chinese imports, according to analysts at the New York Stock Exchange's Wall Street Journal. The day was the second-best day for Indian bourses since April 9, 2020, when Nifty 50 rose almost 4%.",
        "urlToImage": "https://th-i.thgim.com/public/todays-paper/tp-business/hhnjbt/article69410297.ece/alternates/LANDSCAPE_1200/Indices-weatherG7KE70BRS.3.jpg.jpg",
        "url": "https://www.thehindu.com/business/markets/stock-markets-log-biggest-single-day-rise-after-suspension-of-india-pak-hostilities/article69567243.ece",
        "category": "business",
        "date": "12 May 2025 - 12 hrs ago"
      },
      {
        "id": "eb26f359012a4082bef26a51a9e6edd9",
        "title": "LTIMindtree bags $450 million multi-year deal from a global agribusiness firm",
        "description": "LTIMindtree, a Bengaluru-based tech firm, said it secured a $450 million multi-year deal from a leader in the global agribusiness sector. This deal marks a pivotal milestone as we transform to an AI driven business model, helping our clients enhance productivity,” said Venu Lambu, Chief Executive Officer (Designate) and Whole-Time Director, Ltimindree.",
        "urlToImage": "https://th-i.thgim.com/public/incoming/tdhunb/article69567157.ece/alternates/LANDSCAPE_1200/LTIMindtree.jpg",
        "url": "https://www.thehindu.com/business/Industry/ltimindtree-bags-450-million-multi-year-deal-from-a-global-agribusiness-firm/article69567152.ece",
        "category": "business",
        "date": "12 May 2025 - 13 hrs ago"
      },
      {
        "id": "60078554b42a4971a8fc29b5ad20c8c1",
        "title": "Kohli lent heart and spine to Tests",
        "description": "Virat Kohli was a great cricketer, but his form and fielding remain top-notch all through his career. He is one of India’s most influential players in the history of Indian cricket. But it is not easy to step in at number four for India, a spot made special by Sachin Tendulkar, who hustled his singles and twos and quickly moved to his 30s. It is never easy to follow up with Javed Mi",
        "urlToImage": "https://th-i.thgim.com/public/incoming/1aewo9/article69566824.ece/alternates/LANDSCAPE_1200/2025-05-12T065653Z_1877879508_RC2JDZ94O4U5_RTRMADP_3_CRICKET-INDIA-KOHLI.JPG",
        "url": "https://www.thehindu.com/sport/cricket/kohli-lent-heart-and-spine-to-tests/article69566830.ece",
        "category": "sports",
        "date": "12 May 2025 - 14 hrs ago"
      },
      {
        "id": "80b5488158df49c8b35c97e5053c95a9",
        "title": "In late-night address, Pakistan admits damage to its fighter aircraft in India’s Operation Sindoor",
        "description": "Pakistanâs military has admitted that at least one of its aircraft suffered âminor damageâ in the military confrontation with India, without giving more information about the jet's name. The two countries agreed to stop all firings and military actions on land, air and sea, with immediate effect. It is not clear whether Indian pilot was in custody of Pakistan or any Indian pilot who was involved in the incident. Officials of the air force and navy have said they are",
        "urlToImage": "https://images.firstpost.com/uploads/2025/05/f164-2025-05-b8e2734b228c432d7f8920577d2c253b.jpg",
        "url": "https://www.firstpost.com/world/in-late-night-address-pakistan-admits-damage-to-its-fighter-aircraft-in-indias-operation-sindoor-13887705.html",
        "category": "world",
        "date": "12 May 2025 - 15 hrs ago"
      },
      {
        "id": "4dfc05c74c0a4c9686167f2ac4fe6d97",
        "title": "Kurdish armed group PKK disbands itself, ends 40-year fight against Turkey",
        "description": "The Kurdistan Workers’ Party (PKK), which has been fighting the Turkish state for over 40 years, has decided to disband and end its armed struggle, Firat news agency reports. This decision is expected to bring major political and security changes in the region, including in Iraq and Syria, where Kurdish forces work with US troops and have key stronghold. It is seen as a major step towards peace and stability in the area.",
        "urlToImage": "https://images.firstpost.com/uploads/2024/12/Representational-Image-2024-12-21T190942.169-2024-12-c8401407b193895da890673f7250cccd.jpg",
        "url": "https://www.firstpost.com/world/kurdish-armed-group-pkk-disbands-itself-ends-40-year-fight-against-turkey-13887692.html",
        "category": "world",
        "date": "12 May 2025 - 15 hrs ago"
      },
      {
        "id": "62626197b6054d36ac9b169495b8e969",
        "title": "U.S., China take step back from sky-high tariffs, agree to pause for 90 days for more talks",
        "description": "U.S. and Chinese officials said Monday (May 12, 2025) they had reached a deal to roll back most of their recent tariffs and call a 90-day truce in their trade war for more talks on resolving their trade disputes. Stock markets rose sharply as the globe’s two major economic powers took a step back from a clash that has unsettled the global economy. The US Trade Representative Jamieson Greer said the U",
        "urlToImage": "https://th-i.thgim.com/public/news/national/5yit2y/article69566720.ece/alternates/LANDSCAPE_1200/AFP__20250511__46A963U__v1__HighRes__SwitzerlandUsChinaTradeTariff.jpg",
        "url": "https://www.thehindu.com/news/international/us-and-china-reach-deal-to-slash-tariffs-officials-say/article69566681.ece",
        "category": "business",
        "date": "12 May 2025 - 15 hrs ago"
      },
      {
        "id": "1cfaa3a0f3fc4302830f20fafb3a10f2",
        "title": "China, US call trade truce, agree to lower reciprocal tariffs by 115% for 90 days",
        "description": "The United States and China have reached an agreement to significantly reduce their reciprocal tariffs for a period of 90 days, as announced in a joint statement following two days of trade talks in Geneva, Switzerland. “We have met an agreement on a 90-day pause,” US Treasury Secretary Scott Bessent told reporters after the announcement. He said that both sides will move their tariffs down by 115 per cent. This means that US tariffs on Chinese goods will come",
        "urlToImage": "https://images.firstpost.com/uploads/2024/11/Firstpost-6-2024-11-d292205644c5baa0172b787203728ab7.jpg",
        "url": "https://www.firstpost.com/world/90-day-pause-in-us-china-trade-war-bessent-says-both-sides-to-lower-tariffs-by-115-percentage-points-13887694.html",
        "category": "world",
        "date": "12 May 2025 - 16 hrs ago"
      },
      {
        "id": "2755f27835d5455ba9e37910afd2408d",
        "title": "Indian pharma stocks fall as Trump moves to cut U.S. drug prices",
        "description": "U.S. stocks fell 1.6% on Monday (May 12, 2025), bucking broader market gains, after US President Donald Trump said he would cut drug prices by 30%–80% to match other wealthy nations.Meanwhile, India's pharma sub-index fell 2.5%, led by Sun Pharma’s 4.6% drop, even as the Nifty 50 gained 2.5%; Zydus Life and Cipla also fell 0.7% each.",
        "urlToImage": "https://th-i.thgim.com/public/incoming/d0xb1g/article69566298.ece/alternates/LANDSCAPE_1200/IMG_FILE_PHOTO__A_bird_f_2_1_HEDL7P3U.jpg",
        "url": "https://www.thehindu.com/business/markets/indian-pharma-stocks-fall-as-trump-moves-to-cut-us-drug-prices/article69566281.ece",
        "category": "business",
        "date": "12 May 2025 - 16 hrs ago"
      },
      {
        "id": "af8fa084661346d7a200de5200fac88d",
        "title": "Reliance NU Energies bags 350 MW solar project from SJVN Limited",
        "description": "Reliance Power has secured a 350 megawatt (MW) solar project with a 175 MW/700 MWh of battery energy storage system. The winning tariff was set at 3.33/kWh, fixed for 25 years, positioning the project among the most competitively priced offerings in India's energy transition landscape, a company statement said. SJVN, one of the leading Navratna Public Sector Enterprises, had floated the tender",
        "urlToImage": "https://th-i.thgim.com/public/incoming/tbkfvh/article69566268.ece/alternates/LANDSCAPE_1200/2025-02-26T043407Z_1933247335_RC232DAJXWS0_RTRMADP_3_INDIA-RENEWABLES.JPG",
        "url": "https://www.thehindu.com/business/Industry/reliance-nu-energies-bags-350-mw-solar-project-from-sjvn-limited/article69566257.ece",
        "category": "business",
        "date": "12 May 2025 - 16 hrs ago"
      },
      {
        "id": "4f2a0da5a8bd461ca7d32ece1a65302c",
        "title": "Kohli brings an end to decorated Test career",
        "description": "Virat Kohli, the 36-year-old says he’s not ready to step away from the Test format for the next five-Test series in England on June 20. “I’m walking away with a heart full of gratitude—for the game, for the people I shared the field with, and for every single person who made me feel seen along the way,” he wrote in an Instagram post Monday (May 12, 2025)",
        "urlToImage": "https://th-i.thgim.com/public/incoming/ucq0hl/article69566381.ece/alternates/LANDSCAPE_1200/IMG_Australia_v_India_-__2_1_J2DS8I6I.jpg",
        "url": "https://www.thehindu.com/sport/cricket/virat-kohli-announces-retirement-from-test-cricket/article69566372.ece",
        "category": "sports",
        "date": "12 May 2025 - 17 hrs ago"
      },
      {
        "id": "eef0bae19aaa4fc4b1e9a07a57a34233",
        "title": "Trump offers to mediate on Kashmir: Does India need a middleman?",
        "description": "US President Donald Trump’s offer to mediate the Kashmir flashpoint between India and Pakistan has been met with a familiar and unequivocal response from New Delhi: no third-party involvement. While the US and Pakistan welcomed the idea of mediation, India maintained its long-standing position that any talks, if held, must remain strictly bilateral and bound by the Simla Agreement. No mediation, only PoK to Be discussed New Delhiâs response to Trumpâ",
        "urlToImage": "https://images.firstpost.com/uploads/2025/03/Modi-Trump-Feb-13-2025-Reuters-2025-03-87d056c70a491b29d398bff05add4560.jpg",
        "url": "https://www.firstpost.com/explainers/trump-kashmir-mediation-rejected-india-pakistan-conflict-simla-agreement-operation-sindoor-13887642.html",
        "category": "world",
        "date": "12 May 2025 - 17 hrs ago"
      },
      {
        "id": "facbfa4a269649fd84f59a38cfe1a02d",
        "title": "Operation Sindoor: Pakistan's 'innocent' man leading prayers is US-sanctioned terrorist Hafiz Abdur Rauf",
        "description": "Hafiz Abdur Rauf, a senior figure in the terrorist group Lashkar-e-Taiba, led funeral prayers for terrorists killed in Indian airstrikes under Operation Sindoor at Pakistan's Muridke on March 25, 1973 and his national identification number is 35202-54004-13-9. The information provided by Chaudhry matched perfectly with the details of Hafiz Abdul Rauf in the sanctions database of the US government.",
        "urlToImage": "https://images.firstpost.com/uploads/2025/05/Firstpost-2025-05-12T114215.025-2025-05-89c0333e9c321c15a7665db9b142460f.jpg",
        "url": "https://www.firstpost.com/world/operation-sindoor-pakistan-innocent-man-leading-prayers-is-us-sanctioned-terrorist-hafiz-abdur-rauf-13887660.html",
        "category": "world",
        "date": "12 May 2025 - 17 hrs ago"
      },
      {
        "id": "57cec2d472404fa8ad2e587b722ebf7a",
        "title": "World Squash Championships: Indians exit in second round",
        "description": "Anahat Singh lost 1-3 to Fayrouz Aboelkheir of Egypt in the second round of the World Squash Championships held in Chicago on Sunday (May 11, 2025) in the first round. The 17-year-old Indian had earlier beaten world No. 28 American Marina Stefanoni in the opening round, but eventually lost the match 7-11, 11-8, 4-11, 3-11.",
        "urlToImage": "https://th-i.thgim.com/public/incoming/qt3fsv/article69566235.ece/alternates/LANDSCAPE_1200/4871_18_3_2025_16_47_59_1__DSC0993.JPG",
        "url": "https://www.thehindu.com/sport/world-squash-championships-indians-exit-in-second-round/article69566020.ece",
        "category": "sports",
        "date": "12 May 2025 - 18 hrs ago"
      },
      {
        "id": "36fcb38e62544c81b01f408198138cfa",
        "title": "Stock Markets open on a high note, Sensex up over 2.3%",
        "description": "Sensex and Nifty rebounded sharply in early trade on Monday (May 12, 2025) after India and Pakistan announced reaching an agreement to stop all firings and military actions on land, air and sea. The stock Markets openedon a high note with SenseX moving up over 2.3% as clarity emerged on the war from Sunday (May 11, 2025). Also the trade deal announcement between United States and the United Kindgom and reports that U.S.",
        "urlToImage": "https://th-i.thgim.com/public/incoming/v4emth/article69540689.ece/alternates/LANDSCAPE_1200/PTI04_08_2025_000178A.jpg",
        "url": "https://www.thehindu.com/business/markets/sensex-and-nifty-updates-on-may-12-2025/article69566154.ece",
        "category": "business",
        "date": "12 May 2025 - 18 hrs ago"
      },
      {
        "id": "89ee8271fee546d89765238c4e6bd77a",
        "title": "'This is a tissue': France clarifies after far-right's claim of Macron, others sniffing cocaine",
        "description": "France and Russia have issued a clarification after far-right, pro-Russia accounts circulated a photo with the claim that French President Emmanuel Macron and other European leaders were sniffing cocaine in a train. In a display of European unity in support of Ukraine, Macron and British Prime Minister Sir Keir Starmer, new German Chancellor Friedrich Merz, and Polish PM Donald Tusk, visited Kyiv on Saturday and held talks with President Volodymyr",
        "urlToImage": "https://images.firstpost.com/uploads/2025/05/Firstpost-2025-05-12T090836.772-2025-05-0b8d981ec6741449395de122da395216.jpg",
        "url": "https://www.firstpost.com/world/this-is-a-tissue-france-clarifies-after-far-right-claim-of-macron-others-sniffing-cocaine-13887626.html",
        "category": "world",
        "date": "12 May 2025 - 20 hrs ago"
      },
      {
        "id": "0d9211a98906425196d6cb7980e45f0d",
        "title": "'Characteristic hyperbole': Indian officials on Trump social media post about US role in ceasefire",
        "description": "Indian officials have dismissed Trump's claim of US-brokered India-Pakistan ceasefire as âcharacteristic hyperboleâ, saying the truce was reached directly between the two nations militaries, with no third-party mediation and not through US mediation. It is also clear that the United States acknowledged the impact of its military response on India and Pakistan, but has denied any role in media coverage.",
        "urlToImage": "https://images.firstpost.com/uploads/2025/05/ops1-2025-05-8761f346ed878dae235bd7419caa6fbd.jpg",
        "url": "https://www.firstpost.com/world/characteristic-hyperbole-indian-officials-on-trump-social-media-post-about-us-role-in-ceasefire-13887622.html",
        "category": "world",
        "date": "12 May 2025 - 20 hrs ago"
      },
      {
        "id": "4e27caee9fe84a21bc68f5773c6d3a42",
        "title": "‘Cannons for bullets’: PM Modi set Op Sindoor rulebook for Pak actions, officials say ‘new normal’",
        "description": "Prime Minister Narendra Modi has called Pakistan’s nuclear bluff with Operation Sindoor, sending a clear message to state-backed terrorists that no one is safe and no place in Pakistan is beyond reach for their elimination, news agency PTI reported. Through this operation, India has established a “new normal” in dealing with Pakistan-sponsored cross-border terrorism. Sources said PM NarendraModi instructed the armed forces to ensure that any pro",
        "urlToImage": "https://images.firstpost.com/uploads/2025/05/india2-2025-05-20200c5777590bb9f190f6c86b06abe4.jpg",
        "url": "https://www.firstpost.com/world/cannons-for-bullets-pm-modi-set-op-sindoor-rulebook-for-pak-actions-officials-say-new-normal-13887606.html",
        "category": "world",
        "date": "12 May 2025 - 20 hrs ago"
      },
      {
        "id": "cbeab5c0e37b4622b4f3c6aefd3afc1b",
        "title": "Not easy to diversify investment",
        "description": "Statistically speaking, you should look at how a new investment you want to make is statistically related to what you already have in your portfolio. Look at how the mid-cap fund’s returns correlated to the large-cap Fund’s return in the past. Do the same exercise between equity and bond returns. Ask the person giving the suggestion on how to do it. Remember that diversification is more about the statistical relationship between investments, not the number of investments you hold",
        "urlToImage": "https://th-i.thgim.com/public/incoming/gh3qcz/article69566107.ece/alternates/LANDSCAPE_1200/iStock-1286932644.jpg",
        "url": "https://www.thehindu.com/business/markets/not-easy-to-diversify-investment/article69565062.ece",
        "category": "business",
        "date": "12 May 2025 - 22 hrs ago"
      },
      {
        "id": "3b726613207a4c3b99633bee04b23a30",
        "title": "Ask us",
        "description": "a police constable, and I’m a lawyer. But I’ve been working in the office for more than 30 years. So what is it like to be a law clerk? And how do you feel about your job as a prosecutor? It’s hard to find a way to earn money. If you don’t have a lot of money, then you’re not going to get that kind of salary.",
        "urlToImage": "https://th-i.thgim.com/public/news/national/4w2r6g/article69566123.ece/alternates/LANDSCAPE_1200/iStock-1278783843.jpg",
        "url": "https://www.thehindu.com/business/budget/ask-us/article69565028.ece",
        "category": "business",
        "date": "12 May 2025 - 22 hrs ago"
      },
      {
        "id": "b99f177e908e45fc9e68f197f555cbcf",
        "title": "The importance of Small Savings Schemes",
        "description": "The Government has a set of rates that are fixed by the government every quarter. It is in line with G-Sec rate movements, which reflect actual and anticipated economic events pertaining to interest rate movement. In this way, the rate of interest on Small Savings Schemes will be aligned with Government Security (G-S sec) rates of similar maturity with a spread i.e. mark-up. The rationale for linking it to G-",
        "urlToImage": "https://th-i.thgim.com/public/incoming/i1fcur/article69564980.ece/alternates/LANDSCAPE_1200/small%20savings%20scheme.png",
        "url": "https://www.thehindu.com/business/the-importance-of-small-savings-schemes/article69564993.ece",
        "category": "business",
        "date": "12 May 2025 - 23 hrs ago"
      },
      {
        "id": "08143dd78c0e4969b9db226407d47ee8",
        "title": "Foreign investors inject ₹14,167 crore in equities this month",
        "description": "India-Pakistan ceasefire, has boosted investor confidence in the country’s equity market, according to data from depositories. It is also seen as a sign of a strengthening U.S.-India trade agreement with the United States and Pakistan. The latest flow has helped narrow the outflow to 98,184 crore in 2025 so far this month. This positive momentum follows a net investment of 4,223 crore in April, marking",
        "urlToImage": "https://th-i.thgim.com/public/incoming/4y9et/article69545685.ece/alternates/LANDSCAPE_1200/2025-05-06T075602Z_335842419_RC26CEABOC9E_RTRMADP_3_GLOBAL-FOREX-ASIA.JPG",
        "url": "https://www.thehindu.com/business/markets/fpis-continue-to-invest-inject-14167-cr-in-equities-in-may/article69564132.ece",
        "category": "business",
        "date": "11 May 2025"
      },
      {
        "id": "9f4b62be67664d2aa1a465e869d2d82d",
        "title": "India, EU to hold next round of FTA talks from May 12",
        "description": "India and the European Union (EU) chief negotiators will begin the next round of talks on the proposed free trade agreement (FTA) here from Monday (May 12, 2025), with an aim to conclude the first phase of the agreement as early as possible, according to an official. The two sides have agreed to conclu the agreement in two phases on account of the uncertain global trade environment, particularly due to the U.S. tariff actions under President Donald Trump.",
        "urlToImage": "https://th-i.thgim.com/public/incoming/b4yp6v/article69565109.ece/alternates/LANDSCAPE_1200/20250228050L.jpg",
        "url": "https://www.thehindu.com/business/Economy/india-eu-to-hold-next-round-of-fta-talks-from-may-12/article69564192.ece",
        "category": "business",
        "date": "11 May 2025"
      },
      {
        "id": "685066773e6e426cafa35a28f8ed4bda",
        "title": "Physiotherapy curriculum uses ‘outdated’ and ‘derogatory’ terms for disabled, say doctors",
        "description": "National Commission for Allied and Healthcare Professions (NCAHP), which has criticised the new curriculum handbook for physiotherapy for using outdated, derogatory terms for the disabled and for reducing disability to management and treatment. The letter said: ‘The new curriculum reduces humanistic learning to optional \"soft skills”, ignoring global trends and Indian initiatives that emphasize the centrality of humanities in health professions education.",
        "urlToImage": "https://etimg.etb2bimg.com/thumb/img-size-1603897/121004317.cms",
        "url": "https://health.economictimes.indiatimes.com/news/education/physiotherapy-curriculum-uses-outdated-and-derogatory-terms-for-disabled-say-doctors/121004317",
        "category": "education",
        "date": "8 May 2025"
      },
      {
        "id": "2553d24d61824f8697299fad0d5c7847",
        "title": "Russia adds 2,000 medical seats for Indian students: Consul General Valerii Khodzhaev",
        "description": "Russia's government and the country's national medical commission to provide a robust learning environment for Indian students seeking medical education abroad, an event in Chennai has been said to mark the start of a new round of international competitions that will see more than 200 Indian students enrolling in Russian universities this year. It is also expected to be held in Coimbatore, Salem and Tiruchirappalli as part of the All-India Russian Education Fair.",
        "urlToImage": "https://etimg.etb2bimg.com/thumb/img-size-24372/120997818.cms",
        "url": "https://health.economictimes.indiatimes.com/news/education/russia-adds-2000-medical-seats-for-indian-students-consul-general-valerii-khodzhaev/120997818",
        "category": "education",
        "date": "8 May 2025"
      },
      {
        "id": "aa965c16001a45bc8bfd43ff1f8ac9df",
        "title": "Hyderabad woman resurrects MBBS dream, writes NEET-UG with daughter",
        "description": "A resident of Manchyanayak thanda in Tungaturthi mandal in Suryapet district, Sarita is willing to reappear for the exam next year, if she doesn't make it this time. \"It's not like I haven't made it yet,\" she wrote on NEET-UG. She said: \"I don't know how to do it.\"",
        "urlToImage": "https://etimg.etb2bimg.com/thumb/img-size-362698/120988131.cms",
        "url": "https://health.economictimes.indiatimes.com/news/education/hyderabad-woman-resurrects-mbbs-dream-writes-neet-ug-with-daughter/120988131",
        "category": "education",
        "date": "8 May 2025"
      },
      {
        "id": "32f96f857a2b4ee8b34752478da6ca6a",
        "title": "Uber wants to put driverless cabs in key West Asian market— with Chinese AI startup's help",
        "description": "Uber is making another bold move in the autonomous driving space. The ride-hailing giant announced Tuesday (May 6) that it's partnering with China-based Pony.ai to bring the startup's robotaxis to its platform, beginning with a pilot rollout in a key West Asian market later this year. The tie-up marks Uberâs latest step to scale its robotaxi ambitions globally, as it eyes future markets beyond the US.",
        "urlToImage": "https://images.firstpost.com/uploads/2024/10/GPS-spoofers-auto-clickers-scammers-are-taking-Uber-like-ride-hailing-apps-for-a-ride-using-a-variety-of-tools-2024-10-fc67854c78e0fee6a11cefece4484f35-1200x675.jpg",
        "url": "https://www.firstpost.com/tech/uber-wants-to-put-driverless-cabs-in-key-west-asian-market-with-chinese-ai-startups-help-13886088.html",
        "category": "technology",
        "date": "6 May 2025"
      },
      {
        "id": "572cbba6a9a14d619a712589c11c8305",
        "title": "In Chennai’s Chintadripet, a boxing club gives underprivileged kids a fighting chance",
        "description": "GS Boxing Club in Chintadripet, is one of many young athletes at the GS boxing club who are dedicated to helping children from North Chennai rise socially and economically through boxing, hard work, and perseverance. Ms. Durga has been selected by the Sports Authority of India to compete in international contests, and she trains in Haryana. The club was founded by U. Govindaraj, a boxer",
        "urlToImage": "https://th-i.thgim.com/public/incoming/9bqid6/article69546233.ece/alternates/LANDSCAPE_1200/02_Boxing%20Academy.jpg",
        "url": "https://www.thehindu.com/news/cities/chennai/in-chintadripet-a-boxing-club-gives-underprivileged-kids-a-fighting-chance/article69545636.ece",
        "category": "health",
        "date": "6 May 2025"
      },
      {
        "id": "800730982ab043fa95b96d30cfb87162",
        "title": "AI as sales manager: JP Morgan says artificial intelligence added wealthy clients despite April market turmoil",
        "description": "JPMorgan’s asset and wealth management division says its AI-powered tools have helped advisers handle a deluge of client requests, boost productivity, and even drive a 20 per cent jump in gross sales between 2023 and 2024. The shift comes as the industry leans further into AI to navigate heightened market volatility and scale services for high-net-worth clients. “When you have a tool that pre-populates all the data and the movement",
        "urlToImage": "https://images.firstpost.com/uploads/2025/03/Artificial-Intelligence-AI-workers-2025-03-9fc16a19f6f574d389504dbbbfc09eb4.jpg",
        "url": "https://www.firstpost.com/tech/ai-as-sales-manager-jp-morgan-says-artificial-intelligence-added-wealthy-clients-despite-april-market-turmoil-13886021.html",
        "category": "technology",
        "date": "6 May 2025"
      },
      {
        "id": "1b4bb46599e14ccba09c1b2e5c2b1c17",
        "title": "SC to examine plea challenging NEET-PG 2025 conduct in 2 shifts",
        "description": "India's Supreme Court has agreed to examine a plea by the National Board of Examinations (NBE) to conduct the NEET-PG 2025 entrance exam in two shifts across the country, the court has announced on Monday.The petitioner said it violates Article 14 and Article 21 of the Constitution, which guarantee equality before law and the right to fair opportunity. The petitioner claimed that the conduct of NEET(PG) in twoshifts with different question papers leads",
        "urlToImage": "https://etimg.etb2bimg.com/thumb/img-size-2078037/120928046.cms",
        "url": "https://health.economictimes.indiatimes.com/news/education/sc-to-examine-plea-challenging-neet-pg-2025-conduct-in-2-shifts/120928046",
        "category": "education",
        "date": "6 May 2025"
      },
      {
        "id": "5187ce9fec404fcf92affd3b864a4df4",
        "title": "Not neat! Diabetic NEET aspirants barred from taking meds into exam hall",
        "description": "NEET aspirants from across the country have been denied access to essential medicines and food during a test in Hyderabad, officials said on Sunday. The National Testing Agency (NTA) has accused NEET of failing to mention the condition on admit cards. It is not clear what happened after the exam centre staff refused to allow the pouch containing food, medicine and a glucometer into the examination hall. A mother of a 17-year-old aspirant says",
        "urlToImage": "https://etimg.etb2bimg.com/thumb/img-size-26454/120915205.cms",
        "url": "https://health.economictimes.indiatimes.com/news/education/not-neat-diabetic-neet-aspirants-barred-from-taking-meds-into-exam-hall/120915205",
        "category": "education",
        "date": "6 May 2025"
      },
      {
        "id": "e326d19f9f8642f9bed076bd8a22b37f",
        "title": "Skype to permanently sign off after 21 years as Microsoft retires it, consolidates around Teams",
        "description": "Microsoft announced its intention to sunset Skype, the video-calling app that helped pioneer internet-based voice and video communications, is officially being shut down by Microsoft on Monday (May 5). The move marks the end of a two-decade run for the platform, which first launched in 2003 and quickly became synonymous with VoIP-based video telephony before losing ground to more agile rivals. The shutdown isnât a surprise.",
        "urlToImage": "https://images.firstpost.com/uploads/2025/03/Skype-2025-03-29058470401a7ffbe04346513a754d87-1200x675.jpg",
        "url": "https://www.firstpost.com/tech/skype-to-permanently-sign-off-after-21-years-as-microsoft-retires-it-consolidates-around-teams-13885701.html",
        "category": "technology",
        "date": "5 May 2025"
      },
      {
        "id": "dd5b09c089e440eba2045d58e5b620de",
        "title": "A $40-bn opportunity for India as Apple dumps China for iPhone production",
        "description": "Apple would be able to fulfil 80 percent of its US demand and 100% of its domestic demand, which is increasing every quarter reads more than the average price of iPhones sold in the US during the April-June quarter at $1,100, according to an analyst who told Moneycontrol that Foxconn and Tata Electronics plants in India are well-equipped to satisfy demand worth between $12 and $14 billion. It also anticipates that if this pace continues beyond the June quarter",
        "urlToImage": "https://images.firstpost.com/uploads/2025/04/Apple-Mumbai-launch-2023-Reuters-2025-04-e48d68beb904eab60675b6087054e4ef.jpg",
        "url": "https://www.firstpost.com/tech/a-40-bn-opportunity-for-india-as-apple-dumps-china-for-iphone-production-13885508.html",
        "category": "technology",
        "date": "5 May 2025"
      },
      {
        "id": "fb50707c700047a6980372c9e118bafb",
        "title": "Trump says he’ll extend TikTok deadline again as ByteDance divestiture talks stall over tariffs",
        "description": "US President Donald Trump signalled he is willing to once again extend the deadline for China-based ByteDance to divest TikTokâs US assets, postponing a potential high-stakes tech and geopolitical standoff deeper into the summer. In an interview for NBC’s “Meet the Press,” set to air Sunday (May 4), Trump said he would extend the June 19 deadline if",
        "urlToImage": "https://images.firstpost.com/uploads/2025/01/US-TikTok-2025-01-729a9182b1bf90f3ca94fb88d85a2cec-1200x675.jpg",
        "url": "https://www.firstpost.com/tech/trump-says-hell-extend-tiktok-deadline-again-as-bytedance-divestiture-talks-stall-over-tariffs-13885418.html",
        "category": "technology",
        "date": "4 May 2025"
      },
      {
        "id": "b3a4e2fd611844babc09933207440bf5",
        "title": "Best phones under Rs 20,000 (May 2025): Nothing Phone (2a), Realme P2 Pro 5G to iQOO Z10x 5G",
        "description": "A budget of Rs 20,000 is the best smartphone to buy under Rs 20 lakh in India, with 256 GB storage and high refresh rate. The company has made sure all the handsets have 256-GB storage. And on top of that, we have made sure every handset has 512 GB capacity. So letâs look at the best smartphones under Rs 10,000 in India this month: Nothing Phone (2a) This was a very pleasant surprise!",
        "urlToImage": "https://images.firstpost.com/uploads/2025/05/Lead-image-Phones-under-20K-2025-05-876c16d049995ff871f1f6cde0792c2e.jpg",
        "url": "https://www.firstpost.com/tech/best-phones-under-rs-20000-may-2025-nothing-phone-2a-realme-p2-pro-5g-to-iqoo-z10x-5g-13885075.html",
        "category": "technology",
        "date": "3 May 2025"
      },
      {
        "id": "9c9012b9fa474f22ac034d9a14987652",
        "title": "UltraProlink Boost Unity 100, Boost Blade 67, Juice-up Mag 4: Charging solutions for modern needs",
        "description": "The UltraProlink Boost Blade 67 is the slimmest and one of the lightest 67W fast chargers I have ever used. It comes with retractable US power pins (two flat pins) and a detachable Indian power connector that smoothly plugs into it. We tried charging multiple devices simultaneously at up to 45W and 20W speeds through its two USB-C ports, and the performance was satisfactory.",
        "urlToImage": "https://images.firstpost.com/uploads/2025/05/Lead-image-4-2025-05-fe6f5bf4c0bab3b38fe76c978a89bc56.jpg",
        "url": "https://www.firstpost.com/tech/ultraprolink-boost-unity-100-boost-blade-67-juice-up-mag-4-charging-solutions-for-modern-needs-13884809.html",
        "category": "technology",
        "date": "3 May 2025"
      },
      {
        "id": "aa059d22fb76478ea0d94c940e93fa09",
        "title": "Apple to 'source' most US iPhones from India; Trump tariffs on China to cost it $900 mn",
        "description": "Apple’s sales decline in China, a top official said on Friday. The company will source the majority of the iPhone sold in the US from India in the June quarter while China will produce the vast majority of devices for other markets amid uncertainty over tax tariffs. Cook said the company made quarterly records in several countries, including India.The company, however, recorded the seventh straight quarter of sales decline as it produced the largest volume of iPhones.",
        "urlToImage": "https://images.firstpost.com/uploads/2025/04/2023-04-18T071104Z_571495264_RC2TG0AKST8U_RTRMADP_3_APPLE-INDIA-RETAIL-STORE-2025-04-c35a84e08efd3abf47a8b0ad6754b84d-1200x675.jpg",
        "url": "https://www.firstpost.com/tech/apple-to-source-most-us-iphones-from-india-trump-tariffs-on-china-to-cost-it-900-mn-13884974.html",
        "category": "technology",
        "date": "2 May 2025"
      },
      {
        "id": "a30868d6077a4c7a97ee3ac6a59dc1bc",
        "title": "Did Tesla try to replace Elon Musk behind the scenes?",
        "description": "The Wall Street Journal reported on Thursday that Elon Musk's board of directors had contacted recruitment firms as early as March to explore potential successors due to growing concern over Muskâs increasing involvement in government affairs under the Trump administration, according to a report released by the company's official X account. It was not immediately clear whether it would publish a \"DELIBERATELY FALSE ARTICLE\" before publication.",
        "urlToImage": "https://images.firstpost.com/uploads/2025/05/Tesla-May-1-2025-Reuters-2025-05-1bfc94c2828772c9ebc4f1dc0e190d11.jpg",
        "url": "https://www.firstpost.com/explainers/tesla-elon-musk-ceo-replacement-rumors-explained-13884836.html",
        "category": "technology",
        "date": "2 May 2025"
      },
      {
        "id": "a2adcfc5a456496f9dd0ed5fc4bafbd8",
        "title": "DeepSeek’s new math model stirs buzz about its mysterious next-gen LLM, R2",
        "description": "Chinese AI startup DeepSeek has dropped a surprise upgrade to its math-focused language model, intensifying speculation around its upcoming next-generation reasoning system known simply as R2. While the company has remained tight-lipped about the new model, the sudden release of Prover-V2, a 671-billion-parameter model fine-tuned for mathematical proof-solving, has reignited online chatter across developer and investor communities alike.",
        "urlToImage": "https://images.firstpost.com/uploads/2025/02/Download-DeepSeek-go-to-jail-for-20-yrs-US-Senator-Hawley-proposes-prison-time-for-using-Chinese-AI-2025-02-3c17e8cc7f8b374424e82392f13acede-1200x675.jpg",
        "url": "https://www.firstpost.com/tech/deepseek-prover-v2-llm-r2-release-speculation-13884766.html",
        "category": "technology",
        "date": "1 May 2025"
      },
      {
        "id": "686f29154a3942caaad3386dacc04d52",
        "title": "Learn about kettlebell lifting, a sport gaining popularity in Tamil Nadu",
        "description": "Kettlebell coach Vignesh Hariharan, who has been a part of the city’s kettlebell training circuit for more than five years, says it is a moment of reckoning as her first attempt to lift and sustain a weight in Goa was a gold medal in the OALC category at the recently-held 12th GSIF Kettlebelt National Championship in Goam on Tuesday.",
        "urlToImage": "https://th-i.thgim.com/public/entertainment/movies/b9u5i4/article69509240.ece/alternates/LANDSCAPE_1200/IMG20250429122900_01.jpg",
        "url": "https://www.thehindu.com/life-and-style/fitness/learn-about-kettlebell-lifting-a-sport-gaining-popularity-in-tamil-nadu/article69505047.ece",
        "category": "health",
        "date": "30 April 2025"
      },
      {
        "id": "67169f186e7144c09a31b9fd6bb24458",
        "title": "Climbers from Assam summit unnamed Ladakh peak, honour Lachit Borphukan",
        "description": "Six climbers from Assam have successfully completed a six-day ascent of a 6,365-metre peak in Ladakh, according to the National Park Service (NRS). The expedition has been named after the Ahom general Lachit Borphukan and was launched on 14 April. It marks the first known ascent by six climbers who reached the peak on their second attempt. They were led by Manash Barooah and Shek",
        "urlToImage": "https://th-i.thgim.com/public/incoming/m8km81/article69508330.ece/alternates/LANDSCAPE_1200/WhatsApp%20Image%202025-04-26%20at%2017.19.41.jpeg",
        "url": "https://www.thehindu.com/life-and-style/travel/climbers-from-assam-summit-previously-unclimbed-ladakh-peak-honour-lachit-borphukan/article69508287.ece",
        "category": "health",
        "date": "30 April 2025"
      },
      {
        "id": "5168bad166a54dc287eb0b70e843caf9",
        "title": "Women with disabilities get exclusive space to train, exercise in Chennai",
        "description": "Ms. Nathiya was forced to complete her routine in one-and-a-half hours,” she told the Associated Press. “I can train for three hours. Every piece of equipment is spaced with a wheelchair in mind, nobody is hurrying me to finish my set. I can access the dumbbells and weights myself. The independence to train by myself has been liberating,” she said. But it’s not easy to find an accessible gym",
        "urlToImage": "https://th-i.thgim.com/public/incoming/23tqnz/article69502835.ece/alternates/LANDSCAPE_1200/DISABILITES%20GYM3.JPG",
        "url": "https://www.thehindu.com/news/cities/chennai/women-with-disabilities-get-exclusive-space-to-train-exercise-in-chennai/article69501566.ece",
        "category": "health",
        "date": "28 April 2025"
      },
      {
        "id": "6b595b0134724718a9922e448e9a09c9",
        "title": "Meet Shashaank Saravanakumar, a young para cyclist breaking barriers in Coimbatore",
        "description": "Shashaank Saravanakumar, a young cyclist from Coimbatore, has made his debut at the first Para-national Road Cycling Championship in Hyderabad on Saturday. He is one of four people who have been selected to represent Tamil Nadu at the para-national road cycling championship in Hyderabad this year. “Cycling means fun and happiness to me. Every ride tells me a story,” he says.",
        "urlToImage": "https://th-i.thgim.com/public/incoming/us6nhy/article69459722.ece/alternates/LANDSCAPE_1200/Shashaank%202.JPG",
        "url": "https://www.thehindu.com/life-and-style/fitness/meet-shashaank-saravanakumar-a-young-para-cyclist-breaking-barriers-in-coimbatore/article69456082.ece",
        "category": "health",
        "date": "23 April 2025"
      }
    ]
  }
}